package chap_07;

public class _01_Class {

	public static void main(String[] args) {
		// 사람 -> 계좌에 입출금, 사람 -> 사람에게 계좌이체
		// 사람과 계좌를 어떻게 표현할까?
		// 사람과 계자를 각각 독립적인 객체로 보고, 객체간의 관계를 구현하자!
		// 이렇게 객체를 이용하여 현실세계를 표현하는 프로그래밍이 객체지향 프로그래밍이다.
		// 사람 : 이름, 나이, 보유금, 계좌
		// 계좌 : 잔액, 소유인
		
		// 클래스를 '설계도'라면 인스턴스는 그 설계도로 생성된 '객체'이다.
		// 예를 들어 Song 이라는 클래스가 있으면,
		// Butter, 사건의 지평선, DNA, ...
		// (클래스는 재사용성이 높음)
		
		// 클래스가 생성되면 자동으로 생성 되는 것 : 생성자
		// 클래스 구성요소 : 필드, 메소드, 생성자
	}
	
}
